tap "homebrew/bundle"

# Core CLI tools
brew "git"
brew "gh"
brew "fnm"
brew "starship"
brew "ripgrep"
brew "fd"
brew "jq"
brew "bat"
brew "eza"
brew "tree"
brew "direnv"

# Common infrastructure/tooling languages
brew "go"
brew "rustup-init"

# Optional but useful for local web development
brew "watchman"

# GUI apps
cask "visual-studio-code"
cask "google-chrome"
cask "firefox"
cask "orbstack"

# Optional API/database tools. Uncomment if wanted.
# cask "bruno"
# cask "tableplus"
