# Core CLI tools.
# Node is intentionally managed by fnm, not Homebrew Node.
brew "git"
brew "gh"
brew "fnm"
brew "starship"
brew "ripgrep"
brew "fd"
brew "jq"
brew "bat"
brew "eza"
brew "mas"
brew "chezmoi"

# Common infrastructure/tooling languages.
# Go and Rust are useful for OSS work such as Ferrocat and modern CLI tooling.
brew "go"
brew "rustup-init"

# GUI apps.
cask "github"
cask "zed"
cask "firefox"
cask "google-chrome"

# Optional editor fallback.
# cask "visual-studio-code"

# Mac App Store apps.
# Keep these entries reviewed; they were reconstructed from local MAS receipts
# because `mas list` was unreliable during the initial train-network setup.
mas "Pages", id: 361309726
mas "Keynote", id: 361285480
mas "Numbers", id: 361304891
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Xcode", id: 497799835
mas "Things", id: 904280696
mas "Fantastical", id: 975937182
mas "Lungo", id: 1263070803
mas "Tailscale", id: 1475387142
mas "1Password for Safari", id: 1569813296
mas "Velja", id: 1607635845
mas "Pure Paste", id: 1611378436
mas "PingZilla", id: 6757017560
